<%@ Page Title="网站建设_网站制作_网页设计_网页制作" Language="C#" %>
<script runat="server">

</script>
<asp:Content ID="seo" ContentPlaceHolderID="seo" Runat="Server">
</asp:Content>
<asp:Content ID="tIpt" ContentPlaceHolderID="tIpt" Runat="Server">
</asp:Content>
<asp:Content ID="body" ContentPlaceHolderID="body" Runat="Server">
    <form class="m">
        <h1>网站建设指南</h1>
        <p>经常有朋友向我咨询网站建设相关的一些问题，在这里我非常感谢大家的信任，同时，也分享下本人多年来在网站建设、运营等方面积累的一些经验，以帮助大家轻松的建设、运营好自己的网站，当我们决定要做一个网站时，可以参考以下步骤：</p>

        <strong>第一步、策划网站</strong>
        <p>某种意义上，真正的建站者是网站主自己，而不是网站承建者，所以，网站的策划工作一定要认真的做到位；</p>
        <p>把网站策划书以书面的形式列出来，并请策划者之外的某人看一遍，看他是否能明白策划文档所述。有些朋友为了省事，直接向网络公司的人员口述需求，须知网络公司来的人一般是业务人员，他会将自己听到的需求转述给设计师，这样的信息传递方式往往会失真，结果可想而知；</p>
        <p>如果条件允许的话，尽可能的和设计师进一步沟通，确保设计师已经充分了解网站策划书，了解网站主的需求，设计师才能设计出您想要的网站外观。</p>
        <strong>第二步、设计网站</strong>
        <p>网站界面完成后，一般都会请网站主确认设计稿，这个时候您需要认真审核设计稿，看界面是不是你想要的外观，如果不是，则要求继续修改设计稿，建站公司在这个时候一定会有足够的耐心修改到你满意为止，但你确认过之后，再要有外观方面的修改要求，却一定不会被无限度、无条件的满足；</p>
        <p>如果你希望网站的用户体验更好些，可以要求设计师设计出一些交互时的外观，比如鼠标经过菜单时的样子等等。</p>
        <strong>第三步、开发网站</strong>
        <p>重视网站的编码质量，很多网站主通常不愿意跟进这个环节，但我建议您重视，因为网站的打开速度、用户体验、搜索引擎收录等等的决定性因素，几乎都会在这个环节里占有相当大的比重，如果您不懂代码的话，可以找个懂网页代码的同事或朋友，帮你把下质量关；</p>
        <p>如果条件允许的话，多和网站开发者沟通，可以把你网站的目标、未来发展方向，甚至运营方案等等都告诉他，这么作的好处是：你有可能得到超值的网站质量和科学的架构。</p>
        <strong>第四步、网站运维</strong>
        <p>
            基于前期的努力，已经拥有网站了，而此时许多网站主已经疲惫不堪，但您还需要再坚持下去，这样才会让之前的工作更有意义；
            推广宣传，这么好的网站如果不让更多的人知道和使用，就有些暴殄天物了，所以要根据需要作广告、网络推广、SEO等方面的工作，尽可能让更多的用户知道你的网站；
        </p>
        <p>留住用户，当您已经拥有了自己的用户时，一定需要提供高质量且对用户价值的内容，在这个前提下，提高用户体验，千万不要让用户因为使用不方便、不人性化而放弃你的网站；</p>
        <p>改版计划，再好的网站也需要适当的改变，这个时候通常需要改版，这个工作通常由网站运维决策者提出，千万不要刻舟求剑，觉得自己的网站能够一劳永逸的永远受到欢迎，如果真的如此，那您一定有办法让自己的网站更受欢迎。</p>
        <strong>第五步、域名注册与备案</strong>
        <p>很多朋友为了省事，会把域名注册、空间或服务器租赁的工作让建站一并公司代理，我在这里提醒大家最好不要这样作，域名是网站主的虚拟财产，要保护好自己，以避免不必要的麻烦；</p>
        <p>注册域名时，尽量选择简单、易记些的，如果能与自己的网站性质、用途相关的话，就更好了；</p>
        <p>选择正规的域名服务商，如持有域名注册服务批文和通过工信部备案系统认证的服务商，如我所知道的万网等。</p>
        <strong>第六步、租用空间或服务器</strong>
        <p>同样，空间或服务器的权限更直接关系到网站的安全，即便是建站者帮你上传，也要记得收回权限并及时修改密码。</p>
        <p>空间可以根据需要选择，如虚拟主机、服务器合租或单独租、甚至自购服务器，然后再找机房托管。如果是新网站，且数据量、访问量不大，可以选择能满足需要的经济套餐，后期数据量、访问量渐增，可以根据需要改套餐，价格一般在300元~20000元不等。</p>
        <strong>写给开发者：</strong>
        <p>以上几个步骤中多次提到了网站开发者，可见开发者在网站整个的开发、运营等方面举足轻重的地位，那么作为网站的开发者，您需要具备一定的职业道德、修养：</p>
        <p>我们是开发者，而不是商人，就应该站在网站主(通常是我们的老板或客户)的立场上，认真负责、精益求精的完成编码工作，而不要为了尽快完成任务，去应付、蒙蔽，甚至欺骗自己的上司、老板或客户，我奉劝这些开发者：永远不要践踏自己良心和道德，也不要自掘坟墓；</p>
        <p>对于网站开发者而言，行业技术日新月异，而几乎每个新思想、新技术总是能够带来令人兴奋的消息：它们能够提高网站运行速度、降低网站开发和维护的人力成本等......</p>
        <p>所以，不要"复制+粘贴"数年前的老代码，甚至盯着数年前的老习惯、老经验不放，并期待它永远让我们受益，如果您自认为自己真的受益了，我想提醒下，网站主正因为你的"受益"而受害了。我奉劝这些开发者：不要刻舟求剑，更不要损人利己。</p>
    </form>
</asp:Content>
<asp:Content ID="bIpt" ContentPlaceHolderID="bIpt" Runat="Server">
</asp:Content>

